2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/LEV_SynchronisatieStamgegeven_request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>${DataSource Values#Header_EEE1}</soapenv:Header>
    <soapenv:Body>
        <brp:lvg_synGeefSynchronisatieStamgegeven xmlns:brp="http://www.bzk.nl/brp/brp0200">
            <brp:stuurgegevens brp:communicatieID="${DataSource Values#com_id.stuurgegevens1}">
                <brp:zendendePartij>${DataSource Values#zendendePartij_slB1}</brp:zendendePartij>
                <brp:zendendeSysteem>${DataSource Values#zendendeSysteem_slB1}</brp:zendendeSysteem>
                <brp:referentienummer>${DataSource Values#referentienummer_slB1}</brp:referentienummer>
                <brp:tijdstipVerzending>${DataSource Values#tijdstipVerzending_slB1}</brp:tijdstipVerzending>
            </brp:stuurgegevens>
            <brp:parameters brp:communicatieID="${DataSource Values#com_id.parameters1}">
                <brp:abonnementNaam>${DataSource Values#abonnementNaam_plB1}</brp:abonnementNaam>
                <brp:stamgegeven>${DataSource Values#stamgegeven_plB1}</brp:stamgegeven>
            </brp:parameters>
        </brp:lvg_synGeefSynchronisatieStamgegeven>
    </soapenv:Body>
</soapenv:Envelope>
